
  ### Terraform Plan

  Detect infra code changes. Please check terraform plan result.

  #### result `success`

  <details><summary>Show Plan</summary>

  ```

  Acquiring state lock. This may take a few moments...
data.http.github_actions_openid_configuration: Reading...
data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
data.tls_certificate.github_actions: Reading...
data.tls_certificate.github_actions: Read complete after 0s [id=42213ff4be793356631c8e7788749fa7d39a9d85]
aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::***:oidc-provider/token.actions.githubusercontent.com]
aws_dynamodb_table.tfstate: Refreshing state... [id=static-site-terraform-lock-dev]
aws_s3_bucket.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev]
data.aws_iam_policy_document.assume_role_for_any_branches: Reading...
data.aws_iam_policy_document.assume_role_for_main_branch: Reading...
data.aws_iam_policy_document.assume_role_for_main_branch: Read complete after 0s [id=3173608891]
data.aws_iam_policy_document.assume_role_for_any_branches: Read complete after 0s [id=1528356676]
aws_iam_role.oidc_admin: Refreshing state... [id=oidc-admin-role]
aws_iam_role.oidc_readonly: Refreshing state... [id=oidc-readonly-role]
aws_iam_role_policy_attachment.admin_for_terraform: Refreshing state... [id=oidc-admin-role-20240113182054004700000001]
aws_iam_role_policy_attachment.readonly_for_terraform: Refreshing state... [id=oidc-readonly-role-20240108152622657800000002]
data.aws_iam_policy_document.write_to_tf_lock: Reading...
data.aws_iam_policy_document.write_to_tf_lock: Read complete after 0s [id=1275146936]
aws_iam_policy.write_to_tf_lock: Refreshing state... [id=arn:aws:iam::***:policy/allow-write-to-tf-lock]
aws_iam_role_policy_attachment.write_to_tf_lock: Refreshing state... [id=oidc-readonly-role-20240108152622642300000001]
aws_s3_bucket_versioning.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev]
aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev]
aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev]
aws_s3_bucket_lifecycle_configuration.tfstate: Refreshing state... [id=tfstate-takekou-static-site-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test will be created
  + resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "takekou-my-ci-test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>
